====================================
Empty pattern
====================================

{}

------------------------------------

(program
  (rule
    (block)))

====================================
Empty block
====================================

NR == 1

------------------------------------

(program
  (rule
    (pattern
      (binary_exp
         (identifier)
         (number)))))

====================================
Block of block and statement
====================================

{
  a
  {}
  a
}

------------------------------------

(program
  (rule
    (block
      (identifier)
      (block)
      (identifier))))

====================================
Directives
====================================

@include "file1"
@load "file2"
@namespace "ns"

------------------------------------

(program
  (directive
    (string))
  (directive
    (string))
  (directive
    (string)))

====================================
Line continuation
====================================

\
BEGIN {}

------------------------------------

(program
  (rule
    (pattern)
    (block)))
